+-----------------------------------------------------------------------+
|                                                                       |
|                                                                       |
|                          SIEMENS EDA(tm)                              |
|                                                                       |
|                         SLEC(tm) Software                             |
|                                                                       |
|                                                                       |
| This program contains confidential, trade secret information which    |
| is property of Siemens. Any reproduction, use or disclosure of        |
| this program, including any attempt to obtain a human-readable        |
| version of this program, without the express, prior written consent   |
| of Siemens is strictly prohibited.                                    |
|                                                                       |
|             Copyright: Unpublished work. (c) Siemens 2023             |
|                         All rights reserved.                          |
|                                                                       |
| Siemens acknowledges trademarks or registered trademarks of other     |
| organizations for their respective products and services.             |
|                                                                       |
| SLEC-2023.2/1056505  (Jul 18 2023)  linux64  S2307180103              |
|                                                                       |
|                                                                       |
| 64-bit mode                                                           |
| CentOS Linux release 7.9.2009 (Core) x86_64                           |
| AMD EPYC 7763 64-Core Processor x 256                                 |
| 1056530580 kB                                                         |
| ee21                                         Tue Mar 26 16:54:36 2024 |
|                                                                       |
+-----------------------------------------------------------------------+
Command-line: /RAID2/cad/mentor/Catapult/2023.2/Mgc_home/pkgs/cds_cpc/rls/platform/linux64/bin/slec -connect 1544 -workdir /RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/calypto

     [APP-RSS]    Reading startup script '/RAID2/cad/mentor/Catapult/2023.2/Mgc_home/pkgs/cds_cpc/rls/slecrc'
slec> cd /RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker
slec> set SLEC_CPC_PROTOCOL 0
0

slec> set_global message_wrap_at 10000
10000

slec> global env
slec> set env(SLEC_FROM_CATAPULT) 1
1

slec> set env(SLEC_FROM_CATAPULT_IPC) 1
1

slec> set cat2slec_args {-cat2slec_work_dir /RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker -workdir .. -cpc -symbolic_memory_threshold_size 256}
-cat2slec_work_dir /RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker -workdir .. -cpc -symbolic_memory_threshold_size 256

slec> source /RAID2/cad/mentor/Catapult/2023.2/Mgc_home/pkgs/cds_cpc/rls/platform/common/slec/cat2slec.itcl
     [CTS-CDFN]   cat2slec debug information will be logged in "/RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/cat2slec.debug".
     [UI-STATS]   SLEC process is using 63 MB, peak 67 MB, and 2 seconds [+63MB, +67MB, +2s] @ Tue Mar 26 16:54:38 2024

     [CTS-SVI]    Detected SLEC Version : SLEC 2023.2/
     [CTS-CCFN]   The tool command file will be written to "cat2slec.cmd".
     [CTS-CVI]    Detected Catapult Version : 8.2
     [CTS-ETN]    Extracting information for the block "fir::run".
    ######################################################################
    Generating SystemC and RTL wrappers for the specified design
    ######################################################################
     [CTS-SWF]    SPEC Wrapper file(s) is/are : "spec_wrapper.h spec_wrapper.cpp".
     [CTS-SWTMN]  SPEC Design top module name is now "spec_wrapper".
     [CTS-PSW]    Printing SPEC Wrapper files.
     [UI-STATS]   SLEC process is using 68 MB, peak 73 MB, and 2 seconds [+5MB, +6MB, +0s] @ Tue Mar 26 16:54:38 2024

     [CTS-FSSN]   Final SLEC script is generated at: /RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/CDesignChecker/run_design_checker.tcl
     [CTS-SFCI]   cat2slec is running via IPC from Catapult - not exiting TCL shell.
slec> set_global message_wrap_at 10000
10000

slec> set env(SLEC_FROM_CATAPULT) 1
1

slec> rename exit exitproc
slec> proc exit {} {}
slec> set Run_Formal_Part_One 1
1

slec> set Run_Formal_Part_Two 0
0

slec> source run_design_checker.tcl
     [SOL-SCL]    Solver cache location set to 'workdir'.
# # This file is automatically generated by Catapult each time CDesignChecker is
# # is launched from Catapult. Any user-applied edits will be overwritten.
# 
# set ::env(SLEC_GCC_HOME) /RAID2/cad/mentor/Catapult/2023.2/Mgc_home/pkgs/dcs_gcc/usr
# # Property checks
# 
# # add Verification Mode settings
# set_verification_mode -c_property_checks 
config_solver_clustering -enable  -engine StateCheck -max_size 20
     [APP-SCP]    Setting the currently running product to SLEC CPC.
set_global -if_unchanged orc_binary_sim                               1
set_global -if_unchanged print_slec_summary                           0
set_global -if_unchanged stop_at_first_falsification                  0
set_global -if_unchanged ctrl_c_unattended_mode                       1
set_global -if_unchanged generate_testbenches                         0
set_global -if_unchanged output_problem_time_limit                    1
set_global -if_unchanged ceg_generate_testbenches_for              spec
set_global -if_unchanged testbenches_dump_waveforms                   0
set_global -if_unchanged stop_solvers_after_num_falsifications        0
set_global -if_unchanged max_num_testbenches                          0
set_global -if_unchanged _enable_pragma_hls_exclude                   0
set_global -if_unchanged orc_generate_waveforms_for                spec
set_global -if_unchanged systemc_version                            2.3
set_global -if_unchanged sim_max_transactions                       200
set_global -if_unchanged __skip_collect_redundant_identity_nodes      1
set_global -if_unchanged soft_runtime_limit                        7200
set_global -if_unchanged find_invariants                              0
set_global -if_unchanged sim_based_validation_timeout               900
set_global -if_unchanged ceg_flat_sysc_tb                             1
set_global -if_unchanged output_problem_time_limit_factor           4.0
set_global -if_unchanged reduce_memory_exprs                          1
set_global -if_unchanged seq_perform_state_checks              only_bec
set_global -if_unchanged _enable_interim_pass_list                    1
set_global -if_unchanged ceg_generate_checkers                        0
set_global -if_unchanged number_of_ll3_iterations                     3
set_global -if_unchanged enable_hierarchy_synthesis                   1
     [UI-MID]     Message "CEG-BSCI" is now disabled.
     [UI-MID]     Message "CEG-SCVER" is now disabled.
config_trace_files -disable
# 
# # Clear all settings
# config_property_checks -disable -all
# # Enable rules
# config_property_checks -enable -abr -severity error 
# config_property_checks -enable -abw -severity error 
# config_property_checks -enable -acc -severity warning 
# config_property_checks -enable -acs -severity warning 
# config_property_checks -enable -aic -severity warning 
# config_property_checks -enable -als -severity warning 
# config_property_checks -enable -aob -severity error 
# config_property_checks -enable -apt -severity info 
# config_property_checks -enable -awe -severity warning 
# config_property_checks -enable -cas -severity error 
# config_property_checks -enable -cbu -severity warning 
# config_property_checks -enable -ccc -severity warning 
# config_property_checks -enable -cgr -severity warning 
# config_property_checks -enable -cia -severity warning 
# config_property_checks -enable -cmc -severity info 
# config_property_checks -enable -cns -severity warning 
# config_property_checks -enable -cwb -severity warning 
# config_property_checks -enable -dbz -severity error 
# config_property_checks -enable -diu -severity warning 
# config_property_checks -enable -fvi -severity warning 
# config_property_checks -enable -fxd -severity warning 
# config_property_checks -enable -ise -severity error 
# config_property_checks -enable -lrc -severity info 
# config_property_checks -enable -mdb -severity warning 
# config_property_checks -enable -mxs -severity info 
# config_property_checks -enable -nco -severity warning 
# config_property_checks -enable -osa -severity warning 
# config_property_checks -enable -ovl -severity error 
# config_property_checks -enable -pdd -severity warning 
# config_property_checks -enable -riu -severity warning 
# config_property_checks -enable -rrt -severity error 
# config_property_checks -enable -sat -severity warning 
# config_property_checks -enable -stf -severity info 
# config_property_checks -enable -sud -severity warning 
# config_property_checks -enable -umr -severity error 
# 
# # Symbolic Memory Control
# set_global symbolic_memory_threshold_size 256
# 
# # verification effort
# set_verification_effort -medium
set_global number_of_ll3_iterations 3
set_global soft_runtime_limit 7200
set_global output_problem_time_limit 1
set_global __sol_use_engine_time_limit_for_last_output 0
set_global sim_max_transactions 200
set_global sim_based_validation_timeout 900
set_global output_problem_time_limit_factor 4.0
# set_global report_undecided_solver_properties 1
# 
# 
### Reading user-provided value '1' from the Tcl variable 'Run_Formal_Part_One'
### Reading user-provided value '0' from the Tcl variable 'Run_Formal_Part_Two'
# # CDesignChecker Pre-build-design user options
     [UI-BDLM]    Please refer to /RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/calypto/build_design.log for a comprehensive list of messages and warnings issued in build_design. These may provide hints for debugging issues (if any) related to performance, potential out of bound accesses etc.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg UI-BDLM' to show all repetitions.)

     [CPT-RDF]    Reading design files into the 'spec' design library.
     [CPT-SC21]   SystemC version 2.3 features will be used.
     [CPT-UGV]    Using GCC 10.3.0 to parse system function interfaces and STL.
     [CPT-FRD]    Finished reading SystemC files into the 'spec' design library.
     [CPT-LDF]    Linking the 'spec' design library.
     [CPT-CETI]   SC_MODULE class "spec_wrapper" identified as top module for C++ elaboration. The class is defined at (/RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/CDesignChecker/spec_wrapper.h:37)
     [CPT-DCD]    Generating design_checks.db file.
     [CPT-OLX]    Generating design_checks.xml file.
     [CPT-OLT]    Generating design check reports.
     [CPT-FTH]    Found 'spec_wrapper' as the top module of the 'spec' design library.
slec> set Run_Formal_Part_One 0
0

slec> set Run_Formal_Part_Two 1
1

slec> source run_design_checker.tcl
     [SOL-SCL]    Solver cache location set to 'workdir'.
### Reading user-provided value '1' from the Tcl variable '_Design_Already_Read'
### Reading user-provided value '0' from the Tcl variable 'Run_Lint_Only'
### Reading user-provided value '0' from the Tcl variable 'Run_Formal_Part_One'
### Reading user-provided value '1' from the Tcl variable 'Run_Formal_Part_Two'
### Reading user-provided value '0' from the Tcl variable 'Enable_DB_Flow'
### Reading user-provided value '1' from the Tcl variable 'Induction_Depth'
     [CPT-STN]    Synthesizing the 'spec' design library.
     [CDB-STH]    Setting 'spec_wrapper' as the top module of the 'spec' design library.
     [CPT-FBD]    Finished synthesizing the 'spec' design library.
     [UI-STATS]   SLEC process is using 77 MB, peak 346 MB, and 9 seconds [-56MB, +0MB, +0s] @ Tue Mar 26 16:54:45 2024

     [CDB-WDF]    Saving the netlist database to 'design.db'.
<WRN>[CDB-PHNSL]  Port 'spec.rst' was not connected to any downstream logic, or the original logic has been optimized away.
<WRN>[TDB-PHNF]   Constraint is applied to port 'spec.rst' which has no fanout.
<WRN>[CDB-PHNSL]  Port 'spec.rst' was not connected to any downstream logic, or the original logic has been optimized away.
<WRN>[TDB-PHNF]   Constraint is applied to port 'spec.rst' which has no fanout.
# # CDesignChecker user constraints
<WRN>[CTS-SVNF]   Could not find variable(s) 'spec.spec_wrapper::input::rdy'. Corresponding flop map(s) are skipped.
          Near matches: {} 0 
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 9 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:45 2024

<WRN>[UI-GWM]     No properties found in the designs to check. Check if appropriate property checking verification mode was used.
     [CDB-BBWS]   Could not find black box signature for module 'spec.input_ac_channel_read_ln26_bbox_7'.
                  Please try 'help CDB-BBWS' for more detailed help.
     [ORC-SPM]    Running full proof verification.
     [ORC-SPN]    Started netlist transformations on spec and impl designs to make them verification friendly.
     [ORC-FPN]    Finished netlist transformations.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 9 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:45 2024

<WRN>[TDB-UBIE]   Unmapped black-box instances exist. Please refer to file '/RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/calypto/bbox.log' for a complete list of unmapped black-box instances.
                  Please try 'help TDB-UBIE' for more detailed help.
<WRN>[TDB-UBIP]   Unmapped ports for black-box instances exist. Please refer to file '/RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/calypto/bbox.log' for a complete list of unmapped ports of black-box instances.
                  Please try 'help TDB-UBIP' for more detailed help.
     [TA-BBCT]    Bit-blasting the clock tree.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 9 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:45 2024

     [PSS-SDM]    Started mapping the 'spec' and 'impl' designs.
<WRN>[TDB-PUP]    Unmapped output/blackbox-input ports have been disconnected by logic pruning and will not show up in any SLEC generated waveforms. Please refer to '/RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/calypto/mapping.log' for the list of unmapped outputs. Please use the global setting 'set_global prune_unmapped_logic 0' to get SLEC to dump these ports in waveforms.
<WRN>[TDB-DRF]    Some flops have been removed by dead/unmapped logic pruning. Please refer to '/RAID2/COURSE/asoc/asoc020/Catapult_1/fir.v1/./CDesignChecker/calypto/mapping.log' for the list of removed flops.
     [PSS-FDM]    Finished mapping the 'spec' and 'impl' designs.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +1s] @ Tue Mar 26 16:54:46 2024

     [TA-ACDD]    Determining input clock domains.
     [TA-ADCA]    Setting clock ## Clock : _Ideal_Clk_ (Period : 100, Rising edge : 2, Falling edge : 52) is set on spec.clk on automatically inferred clock port 'spec.clk'.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [TA-BBCT]    Bit-blasting the clock tree.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [ORC-SPCM]   Started processing of constraints and maps.
     [TDB-EUS]    Unmapped ports/flops exist. Please refer to the file 'CDesignChecker/calypto/mapping.log' for the complete list of unmapped inputs, outputs and flops.
     [TDB-TNM]    If unmapped flops exist, explicitly specify flop maps or use the command "create_namemap_rule" to make SLEC infer flop maps based on flop names.
     [ORC-FPCM]   Finished processing of constraints and maps.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [ORC-PES]    SLEC will invoke verification engines in the following sequence: SBV -> StateCheck -> HII -> HL3. Please see file 'CDesignChecker/calypto/.solver_progress.log' for further details.
     [ORC-SPR]    Started processing reset.
<WRN>[SIM-NOX]    Port 'spec.rst' does not support 'x' values and will be set to '0' for reset sequence simulation (see global 'value_on_input_pins_during_reset').
                  Please try 'help SIM-NOX' for more detailed help.
<WRN>[SIM-NOX]    Port 'spec.rst' does not support 'x' values and will be set to '0' for reset sequence simulation (see global 'value_on_input_pins_during_reset').
                  Please try 'help SIM-NOX' for more detailed help.
<WRN>[SIM-NOX]    Port 'spec.rst' does not support 'x' values and will be set to '0' for reset sequence simulation (see global 'value_on_input_pins_during_reset').
                  Please try 'help SIM-NOX' for more detailed help.
     [ORC-FPR]    Finished processing reset. For the list of reset-values, please refer to calypto/reset.log.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [SIM-SSBV]   Started performing simulation-based validation (see 'help sim_based_validation').
     [SIM-FAM]    Simulation will attempt to find all mismatches within 200 transactions (see 'help sim_finds_only_earliest_mismatches' and 'help sim_max_transactions').
     [SIM-NMMF]   Simulation did not find any mismatches.
     [SIM-FSBV]   Finished performing simulation-based validation.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [ORC-SSRAO]  Started performing optimizations.
     [ORC-FSRAO]  Finished performing optimizations.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [ORC-SCCIV]  Started performing consistency checks in the spec and impl designs.
     [ORC-FCCIV]  Finished performing consistency checks in the spec and impl designs.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [ORC-UDM]    Starting to unroll the design to obtain outputs and flops for transaction 1.
     [TDB-STAC]   Starting to apply constraints for sequential analysis.
     [TDB-DAC]    Finished application of constraints for sequential analysis.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [CDBO-ODU]   Finished performing optimization-enabled design unrolling.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [ORC-UDDM]   Finished unrolling design to obtain outputs and flops for transaction 1.
     [ORC-SSA]    Started sequential analysis.
     [UI-STATS]   SLEC process is using 78 MB, peak 346 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [SEQ-SSCP]   Starting state checks to classify flops as inductive or non-inductive.
     [SEQ-DSCP]   Finished state checks to classify flops as inductive or non-inductive: 1 non-inductive, 0 inductive.
     [UI-STATS]   SLEC process is using 78 MB, peak 482 MB, and 10 seconds [+0MB, +136MB, +0s] @ Tue Mar 26 16:54:46 2024

     [SEQ-PO1M]   Started normalizing spec and impl netlists for sequential analysis.
<WRN>[SEQ-SRFC]   Map application for intermediate/induct maps was sub-optimal for 1 maps. Please look at the .spec_redux.log file in the work directory for more details.
     [SEQ-SOX]    Started optimizations on normalized netlist.
     [SEQ-FOX]    Finished optimizations on normalized netlist.
     [UI-STATS]   SLEC process is using 78 MB, peak 482 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [SEQ-ASD]    Determined 1 to be the acyclic sequential depth of the normalized spec and impl netlists.
     [SEQ-O1M]    Finished normalizing spec and impl netlists for sequential analysis.
     [UI-STATS]   SLEC process is using 78 MB, peak 482 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [SEQ-SIIC]   Starting high-effort induct map init checks.
     [SEQ-NIIPP]  Posing 1 induct map init check problems.
     [SEQ-SWTWP]  Current Solver Progress : 1 init_check problems proven, 0 falsified, 0 remaining : 5 seconds elapsed.
     [SEQ-FIIC]   Finished high-effort induct map init checks.
     [SEQ-OOP]    Overall Progress : 1 induct init check problems proven, 0 falsified, 0 remaining.
     [UI-STATS]   SLEC process is using 78 MB, peak 482 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024

     [SEQ-TTPS]   Starting sequential analysis (Engine L0).
     [SEQ-OOP]    Overall Progress : 1 output problems proven, 0 falsified, 0 remaining.
     [SEQ-DTPS]   Finished sequential analysis (Engine L0).
     [ORC-FSA]    Finished sequential analysis.
     [UI-STATS]   SLEC process is using 78 MB, peak 482 MB, and 10 seconds [+0MB, +0MB, +0s] @ Tue Mar 26 16:54:46 2024


No problems were falsified.


     [CPT-DCD]    Generating design_checks.db file.
     [CPT-OLX]    Generating design_checks.xml file.
     [CPT-OLT]    Generating design check reports.
     [CPT-DCS]    Summary of Design Checks. 
==================================================================================== 
*****************************Status of Property Checks******************************
==================================================================================== 


                                                    Violated   Waived     Undecided     
==================================================================================== 
FATAL                                               0          0          0             
==================================================================================== 

==================================================================================== 
ERROR                                               0          0          0             
==================================================================================== 

==================================================================================== 
WARNING                                             0          0          0             
==================================================================================== 

==================================================================================== 
INFO                                                0          0          0             
==================================================================================== 

==================================================================================== 

14 warning, 0 error messages
5.247u 0.712s 12.000 0:12.000   77.529m 481.938p
(SLEC process used 482 MB and 12 seconds)
